Repository: RedouaneAmourBaracoda/P12-NextRace
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: fr

# favorite-races.empty-list.message
source: Add or remove a race by tapping the star button on the top right hand corner.
fr: Ajoutez ou supprimez une course en appuyant sur le bouton étoile dans le coin supérieur droit.

# race-detail.address.accessibility-label
source: Address
fr: Adresse

# race-detail.back-button.title
source: Back
fr: Retour

# race-detail.calendar-button.accessibility-hint
source: Press this button to add the race to your personal calendar application
fr: Appuyer sur ce bouton pour ajouter cette course à l'application calendrier

# race-detail.calendar.save-error-alert.message
source: This race could not be added to your calendar. It could be due to denied access to your calendar or simply issue with internal services. Please try again later.
fr: Cette course n'a pas pu être ajoutée à votre calendrier. L'accès peut avoir été restreint ou alors il s'agit simplement d'une erreur interne. Veuillez réessayer plus tard.

# race-detail.calendar.save-succes-alert.title
source: Race Added.
fr: Course ajoutée

# race-detail.calendar.save-success-alert.message
source: The race has been successfully added to your calendar.
fr: La course a été ajoutée à votre calendrier personnel avec succès.

# race-detail.calendar.update-error-alert.message
source: There was an issue while trying to update scheduled races. Make sure to grant access to your calendar when entering this screen. If already granted then please try again later.
fr: Une erreur est survenue en essayant de mettre à jour les courses planifiées dans votre calendrier. Vérifiez que vous ayez bien autorisé l'accès à votre calendrier. Si c'est déjà le cas veuillez réessayer plus tard.

# race-detail.calendar.update-error-alert.title
source: Error with calendar
fr: Erreur avec le calendrier

# race-detail.city.accessibility-label
source: City
fr: Ville

# race-detail.country.accessibility-label
source: Country
fr: Pays

# race-detail.date-added.accessibility-hint
source: For your information, this race is already added to your calendar
fr: Pour votre information, cette course a déjà été ajoutée à votre calendrier

# race-detail.date-not-added.accessibility-hint
source: For your information, this race has not been added yet to your calendar
fr: Pour votre information, cette course n'a pas encore été ajoutée à votre calendrier

# race-detail.date.accessibility-label
source: Date of the race event
fr: Date de la course

# race-detail.favorite-button.activated
source: Bookmarked
fr: Activé

# race-detail.favorite-button.deactivated
source: Unbookmarked
fr: Désactivé

# race-detail.missing-date.accessibility-hint
source: Date information has not ben provided
fr: La date de cette course n'est pas communiquée.

# race-detail.navigation-title
source: Race detail
fr: Détail course

# race-detail.price.accessibility-label
source: Entry Price information
fr: Information sur le prix d'entrée

# race-detail.schedule-button.title
source: Schedule
fr: Agenda

# race-detail.title.accessibility-label
source: Race title
fr: Nom de la course

# race-list.loadmore-button.accessibility-hint
source: Press this button to load more races.
fr: Appuyer sur ce bouton pour charger davantage de courses.

# races.errors.undetermined.description
source: An expected error occurred and couldn't be determined.
fr: Erreur inattendue survenue lors de la recherche.

# races.persistence.errors.undetermined.description
source: Some races couldn't be saved in data base. Please try again later.
fr: Certaines courses n'ont pas pu être correctement sauvegardées en base de données. Veuillez réessayer plus tard.

# races.ticketMaster-api.errors.bad-request.description
source: Missing parameters in the request or some have incorrect format or values out of allowed range.
fr: Des paramètres sont manquants dans la requête ou certains ont un format incorrect ou des valeurs hors de la plage autorisée.

# races.ticketMaster-api.errors.bad-request.user-friendly-description
source: An expected error occurred and couldn't be determined. Please try again later.
fr: Une erreur inattendue est survenue. Veuillez réessayer ultérieurement.

# races.ticketMaster-api.errors.internal-error.description
source: Unexpected Error due to internal issues.
fr: Erreur inattendue due à des problèmes internes.

# races.ticketMaster-api.errors.invalid-request.description
source: Invalid request
fr: Requête invalide.

# races.ticketMaster-api.errors.invalid-request.user-friendly-description
source: There was an issue with race searching services. Access might be restricted or services are simply down.
fr: Les services de courses rencontrent actuellement un soucis indéterminé. L'accès a pu être restreint ou les services sont momentanément interrompus.

# races.ticketMaster-api.errors.invalid-url.description
source: Invalid URL
fr: URL invalide.

# races.ticketMaster-api.errors.not-found.description
source: Data with requested parameters does not exist in service database
fr: Les données avec les paramètres demandés n’existent pas dans la base de données.

# races.ticketMaster-api.errors.too-many-requests.description
source: Quota of requests was exceeded. Retry request later or after extending your key quota.
fr: La limite de demandes a été dépassé. Essayez de nouveau plus tard ou après avoir étendu votre quota de clés.

# races.ticketMaster-api.errors.too-many-requests.user-friendly-description
source: The limit of requests to race services has been exceeded.
fr: La limite de courses a été dépassée.

# races.ticketMaster-api.errors.unauthorized.description
source: API token not providen in the request or if provided does not grant access to this API.
fr: Token API non fourni dans la requête ou alors ne donne pas accès à cette API.

# search.alert.error.title
source: Error
fr: Erreur

# search.button.accessibility-hint
source: This button is disabled when there is already a search in progress.
fr: Ce bouton est désactivé lorsqu'une recherche est déjà en cours.

# search.button.title
source: NEXT RACES
fr: PROCHAINES COURSES

# search.car-image.accessibility-label
source: Image showing the car associated to the selected championship.
fr: Image montrant la voiture associée au championnat sélectionné.

# search.cars.title
source: CHAMPIONSHIP
fr: CHAMPIONNAT

# search.championship-selection.accessibility-hint
source: Below are listed three championships. Pick one of them to search for related races.
fr: Trois championnats automobiles sont listées ci-dessous. Sélectionnez-en un pour la recherche de courses.

# search.championship-selection.accessibility-label
source: Championship selection section
fr: Section championnat

# search.country.title
source: COUNTRY
fr: PAYS

# search.result-list.loadmore-button.title
source: Load more
fr: Charger plus

# search.result-list.screen-title
source: List of races
fr: Liste des courses

# tabs.favorites.title
source: Favorites
fr: Favoris

# tabs.search.title
source: Search
fr: Recherche
